Revit 2024 API
MEPAnalyticalSystem.AnalyticalSystemDomain Property
 The type of analytical system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public AnalyticalSystemDomain AnalyticalSystemDomain { get; }
Visual Basic
Public ReadOnly Property AnalyticalSystemDomain As AnalyticalSystemDomain
	Get
Visual C++
public:
property AnalyticalSystemDomain AnalyticalSystemDomain {
	AnalyticalSystemDomain get ();
}
See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace